#+STARTUP: overview hidestars logdone
#+COLUMNS: %38ITEM(Details) %7TODO(To Do) %TAGS(Context) 
#+OPTIONS: tags:t timestamp:t todo:t TeX:t LaTeX:t          
#+OPTIONS: skip:t @:t ::t |:t ^:t f:t
#+LANGUAGE: en
* ECHO: command echo

[[http://unlicense.org/][https://img.shields.io/badge/License-Unlicense-blue.svg]]

Some answers to the ECHO problem in various programming languages.

ECHO is distributed under the Unlicense.  

You task is to implement the echo command for a sequence of integers: rewrite integers from input to output.
The program is a starting point for solving more interesting problems.

** Input
   A sequence of integers (at most 200000) between 1 and 1000000.
** Output
   The sequence given as input. Print one integer per line.
** Example
#+BEGIN_EXAMPLE
 Input:
 2
 10
 20

 Output:
 2
 10
 20
#+END_EXAMPLE
** Answers

The repository contains answers for the languages listed below.
#+BEGIN_SRC bash :exports results :results output  
    ls - 1 ECHO* | awk -F"." '{print $NF}' | uniq | tr '\n' ' ' 
#+END_SRC

#+RESULTS:
: c py cpp java py R rkt 

** Test Cases
   Some useful test cases are located in the directory ~in~.

* Test and Submit a Program
   
  It is highly recommended to test your program in a shell terminal before submitting it to a judge. 

  For training, you can now submit a program to the sphere-engine [[https://51364960.widgets.sphere-engine.com/lp?hash=zEaCpnaksl][ECHO Widget]].
  When it is done, you will be ready for the next step: solving the [[https://51364960.widgets.sphere-engine.com/lp?hash=WkufwLACgf][TEST]]  and [[https://51364960.widgets.sphere-engine.com/lp?hash=RCTt7EYsvO][STEST]] problems.

  This [[http://www.i3s.unice.fr/~malapert/org/teaching/R/tutoriel-UCAnCODE.html][tutorial]] explains the training process in French.
  
* Documentation, Support and Issues
  
  Use the [[https://github.com/arnaud-m/echo/issues][issue tracker]] here on GitHub to report issues. 
  As far as possible, provide a [[https://en.wikipedia.org/wiki/Minimal_Working_Example][Minimal Working Example]].

